<?php
// 敏感词标识
$cache_fuck = false;

# 重要，敏感词过滤，不然有各种事情
function my_filter_fuck($article) {
	if (isset($GLOBALS["cache_fuck"])) {
    $cache_fuck = $GLOBALS["cache_fuck"];
	}
	else {
		$cache_fuck = false;
	}

    $word_arr = array('菩萨', '肉莲', '明妃', '密宗', '法器', '佛学', '割莲', '活取',
        '藏传', '人皮', '警察', '特警', '金刚杵','钟娜', '乌坎', '陆丰',
        '公安', '制毒', '政府', '书记', '党委', '汕尾', '身份证', '市委',
        '副主席', '主席', '习近平', '事件', '揭阳','强㢨','未成年',
        '身份号', '分尸', '卖婬','普宁','新疆','西藏','布达拉宫','藏南',
        '昆仑山','援藏','赵立坚','冲突','烈士','看守所','米俊海','佛法',
        '佛教','印尼', '迷魂药','微信号','微信小号',
        '收购微信','微信回收','回收微信','微信号','微信账号','vx号','账号回收','婴儿汤',
        '自杀','四海帮','六合彩','周小川','刘明康','尚福林','孔丹','回民吃猪肉',
        '习近平','毛民进党','1989六四','六四','李红智','梁光烈','坤迈','高嘉',
        '国管局','天安门','洪志','法轮','胡新宇','何加棟','王子杰','庆林',
        '刘云山','喇嘛','六四','罂粟','海洛因','惨案','菠菜','分尸','自尽','武警','解放军','军警','突击队','当兵','交警',
        '雪豹','消防','将军','女兵','紫圣','真相','阿图'
    );

    foreach ($word_arr as $key=>$value) {
        if (strpos($article, $value) !== false) {
            $article = str_replace($value, '*', $article);
            $cache_fuck = true;
        }
    }

    return $article;
    #return $cache_fuck;
}


?>